       IDENTIFICATION DIVISION.
       PROGRAM-ID. Seq1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       
       PROCEDURE DIVISION.
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
       
       call "SYSTEM" using "PAUSE".
        goback.
        